ci_yuz/app/Controllers/StudentsController.php

    public function index()
    {
       $displayStudents=new StudentsModel();
       $data['students']=$displayStudents->findAll();
---
SELECT *
FROM `tbl_students`

     public function storeStudent(){
        $insertStudents=new StudentsModel();

       if($img=$this->request->getFile('student_profile')){
            if($img->isValid() && !$img->hasMoved()){

              $ImageName=$img->getRandomName();

              $img->move('uploads/',$ImageName);
            }



        }

      $data=array(
          'student_name' => $this->request->getPost('student_name'),
          'student_id' => $this->request->getPost('student_number'),
          'student_section' => $this->request->getPost('student_section'),
          'student_course' => $this->request->getPost('student_course'),
          'student_batch' => $this->request->getPost('student_batch'),
          'student_grade_level' => $this->request->getPost('student_grade_level'),
          'student_profile' => $ImageName,
      );


      $insertStudents->insert($data);
---
INSERT INTO `tbl_students` (`student_name`, `student_id`, `student_section`, `student_course`, `student_batch`, `student_grade_level`, `student_profile`) VALUES ('yuz', '20000_65fc5b9e2f942', 'Section 2', 'BSCS', '2013', '4', '1711037344_d3c9b97c8fab6bfe7cd2.png')